stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Src/stm32wbaxx_hal_ramcfg.c
/**
  ******************************************************************************
  * @file    stm32wbaxx_hal_ramcfg.c
  * @author  MCD Application Team
  * @brief   RAMCFG HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the RAMs configuration controller peripheral:
  *           + RAMCFG Initialization and De-initialization Functions.
  *           + RAMCFG Parity Error Detection Functions.
  *           + RAMCFG Configure Wait State Functions.
  *           + RAMCFG Write Protection Functions.
  *           + RAMCFG Erase Operation Functions.
  *           + RAMCFG Handle Interrupt and Callbacks Functions.
  *           + RAMCFG State and Error Functions.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                    ##### RAMCFG Peripheral features #####
  ==============================================================================
  [..]
    (+) Each SRAM is managed by a RAMCFG instance.
        (++) SRAM1 placed in Core Domain.
             (+++) Size         = 64 kB (STM32WBA54xx, STM32WBA55xx, STM32WBA5Mxx)
             (+++) Size         = 16 kB (STM32WBA50xx)
             (+++) Base Address = 0x20000000.

        (++) SRAM2 placed in Core Domain.
             (+++) Size         = 64 kB (STM32WBA54xx, STM32WBA55xx, STM32WBA5Mxx)
             (+++) Size         = 48 kB (STM32WBA50xx)
             (+++) Base Address = 0x20010000.

        (++) SRAM6 controls the 2.4 GHz RADIO TXRX and sequence SRAMs.

    In what follows, only the wait state value can be set for SRAM6. Otherwise,
    only SRAM1 and/or SRAM2 are considered.

    (+) Each SRAM can be erased independently through its RAMCFG instance.

    (+) The wait state value for each SRAM can be configured independently
        through its RAMCFG instance.

    (+) SRAM2 is divided into 64 or 48 pages (depending on the product) with
        1 kB granularity. Each page can be write protected independently through
        its RAMCFG instance.

    (+) SRAM2 supports Parity Error Detection (PED)correction feature.
        When the ALE bit is set in RAMCFG SRAM2 control register (RAMCFG_M2CR),
        the failing parity SRAM offset word address is stored in the RAMCFG SRAM2
        parity error address register RAMCFG_M2PEAR.

  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
   (#) Call HAL_RAMCFG_Init() to initialize the RAMCFG peripheral before using
       any feature. Call HAL_RAMCFG_DeInit() to de-initialize the RAMCFG when
       using this peripheral is no more needed or a hardware issue has occurred.

     *** Parity Error Detection (PED) feature ***
     ============================================
    [..]
          (+) Parity is supported by SRAM2 when enabled with the SRAM2_PE user option bit
              in FLASH_OPTR register.

              When enabling SRAM2 parity, it is advised to initialize by software the whole
              RAM memory at the beginning of the code. This to avoid getting parity errors
              when reading non-initialized addresses.

          (+) Call HAL_RAMCFG_EnableNotification() and HAL_RAMCFG_DisableNotification()
              to enable and disable PED interrupts. Interrupts could be:
                    (++) Parity error detection interrupt.
                    (++) Parity error detection interrupt redirected to Non Maskable
                          interrupt (NMI).

              When a parity error is detected the PED and CPED bits are set in RAMCFG SRAM2
              interrupt status register (RAMCFG_M2ISR) and RAMCFG SRAM2 interrupt clear register
              (RAMCFG_M2ICR). An interrupt or NMI can be generated if enabled by the PEIE or PENMI
              bits in the RAMCFG SRAM2 control register (RAMCFG_M2CR).

          (+) Call HAL_RAMCFG_LatchParityErrorAddress() to set ALE bit and track parity error location address

          (+) Call HAL_RAMCFG_GetParityErrorAddress() to get the failing parity SRAM offset word
              address stored in the RAMCFG parity error address register (RAMCFG_M2PEAR) together
              with the failing byte(s) parity error flag and the AHB bus master ID.

              When the PED and CPED bits are already set any subsequent parity failing access SRAM
              offset word address is no longer updated. A new parity error SRAM offset word address will
              only be latched when PED and CPED are cleared.

          (+) Call HAL_RAMCFG_IsParityErrorDetected() to check if an Parity error was detected.
              This API is used in silent mode (No PED interrupt is enabled).

     *** Wait State feature ***
     ==========================
    [..]
          (+) Call HAL_RAMCFG_ConfigWaitState() to configure the wait state value
              for a given SRAM according to the HCLK frequency and voltage range
              scaling.

          (+) Call HAL_RAMCFG_GetWaitState() to get the current configured wait
              state value.

     *** Write protection feature ***
     ================================
    [..]
          (+) Call HAL_RAMCFG_EnableWriteProtection() to enable the write
              protection for the given SRAM2 page(s).

          (+) There is no API to disable write protection as this feature can
              be disabled only by a global peripheral reset or system reset.

          (+) Any write access to a write protected area of SRAM2 causes a
              HardFault interrupt.

